%%4.19写【xiaowu】

-record(furnace,{roleid,refineinfo,furnace_level}).
-record(furnace_add_role_attribute,{roleid,pill_use_info}).

-define(FURNACE_WAIT_OPEN,1).%%炼炉待开启
-define(PILL_REFINING,2).%%代表有丹药在炼制状态
-define(PILL_REFINE_FINISH,3).%%炼制完成
-define(FURNACE_FREE,4).%%代表队列空闲

-define(ALL_PILL_INFO,[{5,2000,42,{3,0,0,0,0},1200,500},
				   {1,300,45,{5,0,0,0,0},1500,800},
				   {1,300,50,{7,1,0,0,0},1800,1000},
				   {1,300,50,{7,1,0,0,0},1800,1000},
				   {1,300,50,{7,1,0,0,0},1800,1000},
				   {1,200,60,{10,3,1,0,0},2100,2000},
				   {1,200,60,{10,3,1,0,0},2100,2000},
				   {1,200,70,{15,5,3,0,0},2400,3000},
				   {1,200,70,{15,5,3,0,0},2400,3000},
				   {1,200,70,{15,5,3,0,0},2400,3000}]).%%丹药信息[{属性值，上限，使用等级，{天妖内丹，寒玉髓，仙人泪，妖磷石，墨灵玉}]，炼制时间，需要钱币}]
-define(ALL_PILL_TEMPLATEID,[19100041,19100051,19100061,19100071,19100081,19100091,19100101,19100111,19100121,19100131]).%%所有药品模板id
-define(All_RESOURCCE_TEMPLATEID,[{13200010,13200011},{13200020,13200021},{13200030,13200031},{13200040,13200041},{13200050,13200051}]).%%所有炼丹材料Id
-define(All_FURNACE_INFO,[{0,1},{10,0.9},{20,0.8},{40,0.7},{70,0.6},{110,0.5},{160,0.4},{220,0.35},{290,0.3},{370,0.25},{460,0.2},{560,0.15},{670,0.1},{790,0.05},{920,0.01}]).%%所有的炼炉信息

-define(ONLY_LOCK_QUEUE_CAN_OPEN,12255).%%只能开启处于锁定状态的队列
-define(PROP_NOT_ENOUGH_TO_OPEN_QUEUE,12256).%%开启队列，道具不足
-define(NO_FREE_QUEUE,12257).%%没有空闲队列
-define(FURNACE_FULL,12258).%%队列已满
-define(FURNACE_HIGHEST,12259).%%炼炉已经是最高等级
-define(PILL_USE_UPPER_LIMIT,12260).%%此丹药使用已达上限

-define(QUEUE_TIME,24*60*60).%%队列开启持续时间